#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ssm_parameter.infra_output: Reading...
data.aws_caller_identity.current: Reading...
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=app-weather-web-task-execution-role]
data.aws_caller_identity.current: Read complete after 0s [id=743794601996]
aws_iam_role.ecs_task_role: Refreshing state... [id=app-weather-web-task-role]
aws_iam_role_policy_attachment.custom: Refreshing state... [id=app-weather-web-task-execution-role-20241215174239643200000002]
data.aws_ssm_parameter.infra_output: Read complete after 0s [id=/app-weather/output]
aws_iam_policy.ecs_cloudwatch_logs_policy: Refreshing state... [id=arn:aws:iam::743794601996:policy/app-weather-web-ecs-cloudwatch-logs]
aws_ecs_task_definition.web_app: Refreshing state... [id=app-weather]
aws_iam_role_policy_attachment.attach_cloudwatch_logs_task_execution_role: Refreshing state... [id=app-weather-web-task-execution-role-20241215174239640400000001]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-2:743794601996:service/app-weather/app-weather-web]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-2:743794601996:service/app-weather/app-weather-web"
        name                               = "app-weather-web"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-weather:14" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.web_app must be replaced
-/+ resource "aws_ecs_task_definition" "web_app" {
      ~ arn                      = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-weather:14" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:743794601996:task-definition/app-weather" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "app-weather" -> (known after apply)
      ~ revision                 = 14 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*